// -----------------------------------------------------------------------------------------
// 📌 타입 주석(Type Annotation)이란?
// ⭐️ URL : https://bit.ly/3GbCf3E
// -----------------------------------------------------------------------------------------
// - "이 변수는 string 타입이다."
// - "이 함수는 boolean 타입을 반환한다."
// - "이 함수는 2개의 number 타입을 전달 받고, number 타입을 반환한다."
// - "이 객체는 colors 프로퍼티를 꼭 포함해야 하며, string 타입으로만 구성된 array 타입이어야 한다."
// -----------------------------------------------------------------------------------------
// 📌 변수 타입(Valiable Types) → `let variable:type = value`
// -----------------------------------------------------------------------------------------
// - 변수 선언 과정에서 설정된 타입 이외의 다른 타입이 할당 시도된 경우, 타입 오류입니다.
//
// - PRIMITIVE TYPES
//   - null, undefined, void, number, string, boolean
//   - any, unknown, never
// - OBJECT TYPES
//   - object, array, function
//   - enum, tuple, etc.
// -----------------------------------------------------------------------------------------
{
    // 문자 타입(string type)
    var message = "\uBCC0\uC218 \uD0C0\uC785\uC740 \uBCC0\uC218 \uC774\uB984 \uB4A4\uC5D0 ':type'\uC744 \uC791\uC131\uD558\uB294 \uAC83\uC744 \uB9D0\uD558\uBA70 \uC774\uB97C \"\uD0C0\uC785 \uC5D0\uB108\uD14C\uC774\uC158\"\uC774\uB77C \uBD80\uB985\uB2C8\uB2E4.";
    // 숫자 타입(number type)
    var currentYear = 2022;
    // 불리언 타입(boolean type)
    var isWatch = false;
    console.log(message);
}
